In [1]:
#依據value,搜尋

import pandas as pd
import numpy as np

df = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
df

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [4]:
#使用比較運算子
series1 = df['two'] >= 7
series1

台北    False
台中    False
台南     True
高雄     True
Name: two, dtype: bool

In [5]:
df[series1]

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [6]:
df[df['two'] >= 7]

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [15]:
df.T[df.loc['台北'] <= 2]

       台北  台中  台南  高雄
one     0   4   8  12
two     1   5   9  13
three   2   6  10  14

In [14]:
#欄,列對調
df.T

       台北  台中  台南  高雄
one     0   4   8  12
two     1   5   9  13
three   2   6  10  14
four    3   7  11  15